<?php

/**
 * @file
 * ExtraWatch - A real-time ajax monitor and live stats
 * @package ExtraWatch
 * @version @VERSION@
 * @revision @REVISION@
 * @license http://www.gnu.org/licenses/gpl-3.0.txt     GNU General Public License v3
 * @copyright (C) 2013 by CodeGravity.com - All rights reserved!
 * @website http://www.codegravity.com
 */

defined('_JEXEC') or die('Restricted access');

//ExtraWatch language file - to create a new language file, just copy the english.php to eg. german.php and place into./components/com_extrawatch/lang/

// Main Menu.
DEFINE('_EW_MENU_STATS', "लाइव स�?थिति");
DEFINE('_EW_MENU_GOALS', "लक�?ष�?यों");
DEFINE('_EW_MENU_SETTINGS', "सेटिंग�?स");
DEFINE('_EW_MENU_CREDITS', "आभार सूची");
DEFINE('_EW_MENU_FAQ', "FAQ");
DEFINE('_EW_MENU_DOCUMENTATION', "प�?रलेखीकरण");
DEFINE('_EW_MENU_LICENSE', "लाइसेंस");
DEFINE('_EW_MENU_DONATORS', "समर�?थक");
DEFINE('_EW_MENU_SUPPORT', "ExtraWatch समर�?थन और आपके विज�?ञापन बैकेंड से हटाये|");


// Left visitors real-time window.
DEFINE('_EW_VISITS_VISITORS', "नवीनतम आगंत�?कों");
DEFINE('_EW_VISITS_BOTS', "Bots");
DEFINE('_EW_VISITS_CAME_FROM', "से आया");
DEFINE('_EW_VISITS_MODULE_NOT_PUBLISHED', "आपका ExtraWatch मॉड�?यूल प�?रकाशित नहीं है! कोई न�? आ�?कड़े दर�?ज की जा रही हैं. इसे प�?रकाशित करने के लि�?, मॉड�?यूल के लि�? जाना अन�?भाग और यह सभी पृष�?ठों पर प�?रकाशित हे|");
DEFINE('_EW_VISITS_PANE_LOADING', "लोड हो रहा है दौरा...");

// Right stats window.
DEFINE('_EW_STATS_TITLE', "सप�?ताह के लि�? आ�?कड़े पर जा�?�?");
DEFINE('_EW_STATS_WEEK', "सप�?ताह");
DEFINE('_EW_STATS_THIS_WEEK', "इस सप�?ताह");
DEFINE('_EW_STATS_UNIQUE', "अद�?वितीय");
DEFINE('_EW_STATS_LOADS', "लोअड�?स ");
DEFINE('_EW_STATS_HITS', "हिट");
DEFINE('_EW_STATS_TODAY', "आज");
DEFINE('_EW_STATS_FOR', "के लि�?");
DEFINE('_EW_STATS_ALL_TIME', "सभी समय");
DEFINE('_EW_STATS_EXPAND', "विस�?तार करना");
DEFINE('_EW_STATS_COLLAPSE', "संक�?षिप�?त करें");
DEFINE('_EW_STATS_URI', "पन�?ने");
DEFINE('_EW_STATS_COUNTRY', "देश");
DEFINE('_EW_STATS_USERS', "उपयोगकर�?ता");
DEFINE('_EW_STATS_REFERERS', "Referers");
DEFINE('_EW_STATS_IP', "IPs");
DEFINE('_EW_STATS_BROWSER', "ब�?राउज़र�?स");
DEFINE('_EW_STATS_OS', "OS");
DEFINE('_EW_STATS_KEYWORDS', "कीवर�?ड");
DEFINE('_EW_STATS_GOALS', "लक�?ष�?यों");
DEFINE('_EW_STATS_TOTAL', "टोटल");
DEFINE('_EW_STATS_DAILY', "दैनिक");
DEFINE('_EW_STATS_DAILY_TITLE', "दैनिक आ�?कड़े");
DEFINE('_EW_STATS_ALL_TIME_TITLE', "सभी समय आ�?कड़े");
DEFINE('_EW_STATS_LOADING', "लोअडिंग...");
DEFINE('_EW_STATS_LOADING_WAIT', "लोअडिंग ... पया प�?रतीक�?षा करें");
DEFINE('_EW_STATS_IP_BLOCKING_TITLE', "IP निर�?द�?ध करना ");
DEFINE('_EW_STATS_IP_BLOCKING_ENTER', "IP मैन�?य�?अल दर�?ज करें");
DEFINE('_EW_STATS_IP_BLOCKING_MANUALLY', "�?क IP पता दर�?ज करें जिसे आप ब�?लॉक करना चाहते हैं. (eg. 217.242.11.54 or 217.* or 217.242.* सभी वाइल�?डकार�?ड मिलान आईपी ब�?लॉक)");
DEFINE('_EW_STATS_IP_BLOCKING_TOGGLE', "सच के अवर�?द�?ध टॉगल ");
DEFINE('_EW_STATS_PANE_LOADING', "लोड हो रहा है स�?थिति...");

// Settings.
DEFINE('_EW_SETTINGS_TITLE', "सेटिंग�?स");
DEFINE('_EW_SETTINGS_DEFAULT', "व�?यतिक�?रम");
DEFINE('_EW_SETTINGS_SAVE', "संचय");
DEFINE('_EW_SETTINGS_APPEARANCE', "रूप");
DEFINE('_EW_SETTINGS_FRONTEND', "दृश�?यपटल");
DEFINE('_EW_SETTINGS_HISTORY_PERFORMANCE', "इति�?हास &amp; निष�?पादन");
DEFINE('_EW_SETTINGS_ADVANCED', "उच�?च");
DEFINE('_EW_SETTINGS_IGNORE', "उपेक�?षा");
DEFINE('_EW_SETTINGS_BLOCKING', "अवर�?द�?ध करना");
DEFINE('_EW_SETTINGS_EXPERT', "निप�?ण");
DEFINE('_EW_SETTINGS_RESET_CONFIRM', "क�?या आप वास�?तव में सभी आ�?कड़ों और आगंत�?क डेटा रीसेट करना चाहते हैं?");
DEFINE('_EW_SETTINGS_RESET_ALL', "सभी रीसेट करें");
DEFINE('_EW_SETTINGS_RESET_ALL_LINK', "सभी आ�?कड़ों रीसेट करें &amp; आगंत�?क डेटा");
DEFINE('_EW_SETTINGS_LANGUAGE', "भाषा");
DEFINE('_EW_SETTINGS_SAVED', "सेटिंग�?स बचाया गया");
DEFINE('_EW_SETTINGS_ADD_YOUR_IP', "अपने IP जोड़ें");
DEFINE('_EW_SETTINGS_TO_THE_LIST', "सूची में.");

// Other / mostly general.
DEFINE('_EW_TITLE', "�?क वास�?तविक समय AJAX joomla की निगरानी");
DEFINE('_EW_BACK', "Back");
DEFINE('_EW_ACCESS_DENIED', "आप किसी भी अन�?मतिया�? देखने के लि�? नहीं है !");
DEFINE('_EW_LICENSE_AGREE', "मैं शर�?तों के ऊपर और शर�?तों के लि�? सहमत हे |");
DEFINE('_EW_LICENSE_CONTINUE', "चालू रहना");
DEFINE('_EW_SUCCESS', "सफल ऑपरेशन");
DEFINE('_EW_RESET_SUCCESS', "सभी आ�?कड़ों और आगंत�?क डेटा सफलतापूर�?वक मिटाया");
DEFINE('_EW_RESET_ERROR', "डेटा मिट सफलतापूर�?वक नहीं, क�?छ गलत हो गया");
DEFINE('_EW_CREDITS_TITLE', "आभार सूची");
DEFINE('_EW_TRENDS_DAILY_WEEKLY', "दैनिक और साप�?ताहिक आ�?कड़े");
DEFINE('_EW_AJAX_PERMISSION_DENIED_1', "AJAX अन�?मति इंकार: कृपया आप joomla के configuration.php में निर�?दिष�?ट डोमेन से इस आ�?कड़ों को देखे - ");
DEFINE('_EW_AJAX_PERMISSION_DENIED_2', "शायद त�?म सिर�?फ अपने डोमेन नाम के सामने में www. भूल गया . आपका जावास�?क�?रिप�?ट तक पह�?�?च की कोशिश कर रहा है ");
DEFINE('_EW_AJAX_PERMISSION_DENIED_3', "ओर से");
DEFINE('_EW_AJAX_PERMISSION_DENIED_4', "क�?या यह सोचने के लि�? बनाता है यह �?क अलग डोमेन हे .");

// Header.
DEFINE('_EW_HEADER_DOWNLOAD', "नवीनतम विस�?तार से कोड प�?राप�?त करें");
DEFINE('_EW_HEADER_CAST_YOUR', "कृपया अपना");
DEFINE('_EW_HEADER_VOTE', "वोट डालना");

// Tooltips.
DEFINE('_EW_TOOLTIP_CLICK', "टूलटिप दिखाने के लि�? क�?लिक करें");
DEFINE('_EW_TOOLTIP_MOUSE_OVER', "टूलटिप दिखाने के लि�? माउस मंडराना");
DEFINE('_EW_TOOLTIP_YESTERDAY_INCREASE', "कल की वृद�?धि");
DEFINE('_EW_TOOLTIP_HELP', "ऑनलाइन के लि�? बाहरी मदद खोलता है");
DEFINE('_EW_TOOLTIP_WINDOW_CLOSE', "इस विंडो को बंद करो ");
DEFINE('_EW_TOOLTIP_PRINT', "छापना");

// Goals.
DEFINE('_EW_GOALS_INSERT', "�?क नया लक�?ष�?य सम�?मिलित करो ");
DEFINE('_EW_GOALS_UPDATE', "�?क लक�?ष�?य नंबर अद�?यतन करो ");
DEFINE('_EW_GOALS_ACTION', "कार�?रवाई");
DEFINE('_EW_GOALS_TITLE', "न�? लक�?ष�?य");
DEFINE('_EW_GOALS_NEW', "न�? लक�?ष�?य");
DEFINE('_EW_GOALS_RELOAD', "फिर से लादना");
DEFINE('_EW_GOALS_ADVANCED', "उन�?नत");
DEFINE('_EW_GOALS_NAME', "नाम");
DEFINE('_EW_GOALS_ID', "id");
DEFINE('_EW_GOALS_URI_CONDITION', "URI हालत");
DEFINE('_EW_GOALS_URI_INVERSED', "URI inversed हालत");
DEFINE('_EW_GOALS_GET_VAR', "GET var");
DEFINE('_EW_GOALS_GET_CONDITION', "GET हालत");
DEFINE('_EW_GOALS_POST_VAR', "POST Var");
DEFINE('_EW_GOALS_POST_CONDITION', "POST हालत");
DEFINE('_EW_GOALS_TITLE_CONDITION', "Title हालत");
DEFINE('_EW_GOALS_USERNAME_CONDITION', "Username हालत");
DEFINE('_EW_GOALS_IP_CONDITION', "IP हालत");
DEFINE('_EW_GOALS_IP_INVERSED', "IP inversed हालत");
DEFINE('_EW_GOALS_CAME_FROM_CONDITION', "हालत से आयाn");
DEFINE('_EW_GOALS_BLOCK', "रोक देना");
DEFINE('_EW_GOALS_REDIRECT', "के लि�? प�?नर�?निर�?देशन URL");
DEFINE('_EW_GOALS_HITS', "हिट�?स");
DEFINE('_EW_GOALS_ENABLED', "सक�?रिय");
DEFINE('_EW_GOALS_EDIT', "सम�?पादन करना");
DEFINE('_EW_GOALS_DELETE', "काटना");
DEFINE('_EW_GOALS_DELETE_CONFIRM', "आप इस लक�?ष�?य के लि�? सभी हाल के आ�?कड़ों डेटा उठ जा�?गा. क�?या त�?म सच में �?क लक�?ष�?य नंबर हटाना चाहते हैं");

// Frontend.
DEFINE('_EW_FRONTEND_COUNTRIES', "देश");
DEFINE('_EW_FRONTEND_VISITORS', "आगंत�?कों");
DEFINE('_EW_FRONTEND_TODAY', "आज");
DEFINE('_EW_FRONTEND_YESTERDAY', "कल को");
DEFINE('_EW_FRONTEND_THIS_WEEK', "इस सप�?ताह");
DEFINE('_EW_FRONTEND_LAST_WEEK', "पिछले हफ�?ते");
DEFINE('_EW_FRONTEND_THIS_MONTH', "इस महीने");
DEFINE('_EW_FRONTEND_LAST_MONTH', "पिछले महीना");
DEFINE('_EW_FRONTEND_TOTAL', "टोटल");

// Settings description - quite long.
DEFINE('_EW_DESC_DEBUG', "ExtraWatch डिबग मोड में है|इस तरह आप त�?र�?टि का कारण बनता है की खोज कर सकते हैं. इसे बंद करने के लि�?, कृपया मूल�?य में EXTRAWATCH_DEBUG बदलने /components/com_extrawatch/config.php from 1 to 0");
DEFINE('_EW_DESC_STATS_MAX_ROWS', "अधिकतम पंक�?तियों को दिखाने जब आ�?कड़े विस�?तारित मोड में हैं|");
DEFINE('_EW_DESC_STATS_IP_HITS', "सभी IP पते है कि पिछले दिनों में इस मान से कम हिट है IP इतिहास से हटा दिया जा�?गा");
DEFINE('_EW_DESC_STATS_URL_HITS', "सभी URL's है कि पिछले दिनों में इस मान से कम हिट है IP इतिहास से हटा दिया जा�?गा.");
DEFINE('_EW_DESC_IGNORE_IP', "आ�?कड़ों से क�?छ आईपी खाये. �?क नई लाइन के साथ अलग. आप यहा�? वाइल�?डकार�?ड का उपयोग कर सकते हैं <br/>Eg. 192.* will ignore 192.168.51.31, 192.168.16.2, etc..");
DEFINE('_EW_DESC_UPDATE_TIME_VISITS', "आगंत�?कों miliseconds में समय ताज़ा डिफ़ॉल�?ट 2000 है, इस के साथ सावधान रहना. फिर पीठ के अंत ExtraWatch प�?नः लोड.");
DEFINE('_EW_DESC_UPDATE_TIME_STATS', "आ�?कड़े miliseconds में ताज़ा समय डिफ़ॉल�?ट 4000 है, इस के साथ सावधान रहना. फिर पीठ के अंत ExtraWatch प�?नः लोड.");
DEFINE('_EW_DESC_MAXID_BOTS', "कितने बॉट दौरा �?क डेटाबेस में रखने के लि�?.");
DEFINE('_EW_DESC_MAXID_VISITORS', "कितने असली दौरा �?क डेटाबेस में रखने के लि�?.");
DEFINE('_EW_DESC_LIMIT_BOTS', "आप कितने बॉट पीछे के अंत में देखेंगे.");
DEFINE('_EW_DESC_LIMIT_VISITORS', "कितने असली आगंत�?कों आप पीठ के अंत में देखेंगे.");
DEFINE('_EW_DESC_TRUNCATE_VISITS', "अधिकतम अक�?षर लंबे शीर�?षकों में दिखाया and urls.");
DEFINE('_EW_DESC_TRUNCATE_STATS', "अधिकतम अक�?षर सही आ�?कड़े पैनल में दिखाया.");
DEFINE('_EW_DESC_STATS_KEEP_DAYS', "डेटाबेस में आ�?कड़ों को रखने के दिन, 0 = infinite.");
DEFINE('_EW_DESC_TIMEZONE_OFFSET', "जब आप अपने होस�?टिंग सर�?वर से �?क अलग समयक�?षेत�?र में हैं. (positive or negative value in hours)");
DEFINE('_EW_DESC_WEEK_OFFSET', "सप�?ताह ऑफसेट, टाइमस�?टैम�?प/(3600*24*7) सप�?ताह के नंबर पर देता है from 1.1.1970, इस ऑफसेट सोमवार साथ बनाने के लि�? इसे श�?रू करने के लि�? �?क स�?धार है ");
DEFINE('_EW_DESC_DAY_OFFSET', "दिन ऑफसेट, टाइमस�?टैम�?प/(3600*24) gives नंबर पर देता है  from 1.1.1970, इस ऑफसेट पर श�?रू करने के लि�? �?क स�?धार है 00:00 ");
DEFINE('_EW_DESC_FRONTEND_HIDE_LOGO', "<b>(functional in PRO version)</b> सामने के अंत में �?क रिक�?त 1x1px चिह�?न का उपयोग करें");
DEFINE('_EW_DESC_IP_STATS', "आईपी ​​पते के आ�?कड़े को सक�?षम करने के लि�?. क�?छ देशों में �?क डेटाबेस में �?क लंबे समय के लि�? IP रखने के कानून द�?वारा निषिद�?ध है. अपने स�?वयं के जोखिम पर प�?रयोग करें.");
DEFINE('_EW_DESC_HIDE_ADS', "यह सेटिंग बैकेंड में विज�?ञापन खाल, यदि वे वास�?तव में त�?म परेशान. उन�?हें रखने करके, आप इस उपकरण के आगे विकास का समर�?थन करते हैं. श�?क�?रिया|");
DEFINE('_EW_DESC_TOOLTIP_ONCLICK', "अनचेक करें, यदि आप पर माउस पर माउस क�?लिक के बजाय टूलटिप को प�?रदर�?शित करना चाहते हैं.");
DEFINE('_EW_DESC_SERVER_URI_KEY', "डिफ़ॉल�?ट 'REDIRECT_URL' है, जो मानक है यदि आप URL का उपयोग न�? सिरे से लिखना, 'SCRIPT_URL' सेट किया जा सकता है अगर यह केवल लॉग index.php");
DEFINE('_EW_DESC_BLOCKING_MESSAGE', "संदेश है कि अवर�?द�?ध उपयोगकर�?ता या अधिक जानकारी क�?यों आप इन उपयोगकर�?ताओं को अवर�?द�?ध कर रहे हैं दिखाया है|");
DEFINE('_EW_DESC_TOOLTIP_WIDTH', "चौड़ाई टूलटिप");
DEFINE('_EW_DESC_TOOLTIP_HEIGHT', "ऊंचाई टूलटिप");
DEFINE('_EW_DESC_TOOLTIP_URL', "आप किसी भी URL यहा�? डाल दिया है आगंत�?क के आईपी कल�?पना कर सकते हैं. ​​{IP} आगंत�?क के आईपी के द�?वारा प�?रतिस�?थापित किया जा�?गा. Eg. http://somewebsite.com/query?iplookup={ip}");
DEFINE('_EW_DESC_IGNORE_URI', "आप किसी भी यूआरआइ आप आ�?कड़ों से अनदेखा किया जा चाहते हैं लिख सकते हैं. आप वाइल�?डकार�?ड (* और?) यहा�? का उपयोग कर सकते हैं. Eg.: /freel?n* ");
DEFINE('_EW_DESC_GOALS_NAME', "यहा�? �?क लक�?ष�?य नाम निर�?दिष�?ट करें. यह नाम आप आ�?कड़े में देखेंगे.");
DEFINE('_EW_DESC_GOALS_URI_CONDITION', "सब क�?छ है कि आपके डोमेन नाम के बाद है. For http://www.codegravity.com/projects/ the URI is: /projects/ (Example to use: <b>/projects*</b>)");
DEFINE('_EW_DESC_GOALS_GET_VAR', "चर �?क चर जो आप URL में �?क के बाद आम तौर पर देख सकते हैं? साइन इन करें या. Eg. http://www.codegravity.com/index.php?<u>name</u>=peter&amp;<u>surname</u>=smith. आप भी इस क�?षेत�?र में <u>*</u> का उपयोग करने के लि�? सभी मिल मूल�?यों को स�?कैन कर सकते हैं . (Example to use: <b>n*me</b>)");
DEFINE('_EW_DESC_GOALS_GET_CONDITION', "यहा�? आप के लि�? पिछले क�?षेत�?र से �?क मूल�?य के लि�? �?क मैच निर�?दिष�?ट है. (Example to use: <b>p?t*r</b>) ");
DEFINE('_EW_DESC_GOALS_POST_VAR', "काफी समान है, लेकिन हम रूपों से पेश मूल�?यों के लि�? जा�?च कर रहे हैं. तो जब आप अपनी वेबसाइट पर �?क फार�?म है, कि �?क क�?षेत�?र है &lt;input type='text' name='<u>experiences</u>' /&gt;. (Example to use: <b>exper*ces</b>)");
DEFINE('_EW_DESC_GOALS_POST_CONDITION', "इस पोस�?ट क�?षेत�?र से मूल�?य के लि�? �?क मैच है. उदा. हम जा�?च करें कि क�?या उपयोगकर�?ता जावा अन�?भव है चाहता हू�?. (Example to use: <b>*java*</b>)");
DEFINE('_EW_DESC_GOALS_TITLE_CONDITION', "�?क पृष�?ठ है कि मैच है �?क शीर�?षक. (Example to use: <b>*freelance programmers*</b>)");
DEFINE('_EW_DESC_GOALS_USERNAME_CONDITION', "लॉग इन उपयोगकर�?ता का नाम है. (Example to use: <b>psmith*</b>)");
DEFINE('_EW_DESC_GOALS_IP_CONDITION', "IP कि �?क उपयोगकर�?ता से आता है: (Example to use: <b>201.9?.*.*</b>)");
DEFINE('_EW_DESC_GOALS_CAME_FROM_CONDITION', "�?क URL है कि उपयोगकर�?ता से आया. (Example to use: <b>*www.google.*</b>)");
DEFINE('_EW_DESC_GOALS_REDIRECT', "उपयोगकर�?ता आपके द�?वारा निर�?दिष�?ट URL पर रीडायरेक�?ट कर दिया जाता है. 'अवर�?द�?ध' की त�?लना में �?क उच�?च प�?राथमिकता क�?या है: (Example to use: <b>http://www.codegravity.com/goaway.html</b>)");
DEFINE('_EW_DESC_TRUNCATE_GOALS', "कितने लक�?ष�?यों तालिका में वर�?ण truncate करने के लि�?");
DEFINE('_EW_DESC_FRONTEND_NO_BACKLINK', "<b>(functional in PRO version)</b> Backlink to codegravity.com,आप इसे अक�?षम कर सकते हैं, लेकिन हम सराहना करता हू�? कि आप इसे वहा�? रखेंगे. श�?क�?रिया");
DEFINE('_EW_DESC_FRONTEND_COUNTRIES', "देशों दृश�?यपटल मॉड�?यूल में क�?ल आ�?कड़े प�?रदर�?शित करता है. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा ");
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_FIRST', "यदि आप आगंत�?कों / दृश�?यपटल में देश के आदेश स�?वैप करना चाहते हैं. अनचेक यह, और आगंत�?कों को पहली बार दिखाई देगा|");
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_NUM', "Number of countries to show in frontend");
DEFINE('_EW_DESC_FRONTEND_VISITORS', "दृश�?यपटल मॉड�?यूल देशों में आगंत�?कों को प�?रदर�?शित करता है. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा");
DEFINE('_EW_DESC_CACHE_FRONTEND_COUNTRIES', "सेकंड में समय दृश�?यपटल में क�?ल देशों के दिलकश कैश");
DEFINE('_EW_DESC_CACHE_FRONTEND_VISITORS', "सेकंड में समय दृश�?यपटल में आगंत�?कों की दिलकश कैश");
DEFINE('_EW_DESC_FRONTEND_VISITORS_TODAY', "के लि�? दृश�?यपटल में आगंत�?कों को दिखाने के लि�?: आज. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_FRONTEND_VISITORS_YESTERDAY', "के लि�? दृश�?यपटल में आगंत�?कों दिखाने के लि�? कल. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_FRONTEND_VISITORS_THIS_WEEK', "के लि�? दृश�?यपटल में आगंत�?कों दिखाने के लि�?: इस सप�?ताह. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_FRONTEND_VISITORS_LAST_WEEK', "पिछले हफ�?ते: दृश�?यपटल में आगंत�?कों को दिखाने के लि�?. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_FRONTEND_VISITORS_THIS_MONTH', "के लि�? दृश�?यपटल में आगंत�?कों दिखाने के लि�?: इस महीने. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_FRONTEND_VISITORS_LAST_MONTH', "पिछले महीने: दृश�?यपटल में आगंत�?कों को दिखाने के लि�?. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_FRONTEND_VISITORS_TOTAL', "ExtraWatch स�?थापना के बाद क�?ल संख�?या आगंत�?कों को दिखाने के. यदि बदल गया है, इस सेटिंग दृश�?यपटल में प�?रभावी होने के बाद बार CACHE_FRONTEND_ में स�?थापित किया जा�?गा...");
DEFINE('_EW_DESC_LANGUAGE', "Language file to use. They are placed in /components/com_extrawatch/lang/. यदि आप �?क ब�?रांड नई भाषा फ़ाइल बनाना चाहते हैं, पहले परियोजना के म�?खपृष�?ठ की जा�?च, और यदि भाषा फाइल अभी भी वहा�? नहीं है, बस डिफ़ॉल�?ट english.php की प�?रतिलिपि करने के लि�? जैसे. german.php और इस निर�?देशिका में यह जगह. फिर, दाईं तरफ सभी प�?रम�?ख मूल�?यों अन�?वाद.");
DEFINE('_EW_DESC_GOALS', "लक�?ष�?यों को आप विशेष पैरामीटर निर�?दिष�?ट करने के लि�? अन�?मति देते हैं. जब इन मापदंडों मैच काउंटर लक�?ष�?य वृद�?धि ह�?ई. इस तरह आप की निगरानी कर सकते हैं कि क�?या उपयोगकर�?ता �?क विशिष�?ट URL का दौरा किया है, �?क विशिष�?ट मूल�?य पोस�?ट, �?क विशिष�?ट उपयोगकर�?ता नाम है या �?क विशिष�?ट पते से आया है. त�?म भी ब�?लॉक या क�?छ अन�?य यूआर�?ल के लि�? इस तरह के उपयोगकर�?ताओं को अन�?प�?रेषित कर सकते हैं.");
DEFINE('_EW_DESC_GOALS_INSERT', "नाम आप उपयोग कर सकते हैं * को छोड़कर सभी क�?षेत�?रों के में और? वाइल�?डकार�?ड के रूप में. For example: ?ear (will match: near, tear, ..),  p*r (will match: pr, peer, pear ..) ");
DEFINE('_EW_DESC_GOALS_BLOCK', "1Set के लि�? 1 के लि�? सेट करें, यदि आप आगंत�?क अवर�?द�?ध होना चाहता हू�?. और किसी भी प�?नर�?निर�?देशन बिना अपने IP 'अवर�?द�?ध' आ�?कड़े करने के लि�? जोड़ा जाता है - वह सामग�?री के बाकी सिर�?फ संदेश है कि वह अवरोधित किया गया था नहीं देखेंगे (Example to use: <b>1</b>)");

/* new translations */
DEFINE('_EW_GOALS_COUNTRY_CONDITION', "देश की हालत");
DEFINE('_EW_GOALS_COUNTRY_INVERSED', "देश inversed स�?थिति");
DEFINE('_EW_DESC_GOALS_COUNTRY_CONDITION', "2 - पत�?र ऊपरी मामले में देश कोड (Eg: <b>TH</b>)");
DEFINE('_EW_STATS_INTERNAL', "आंतरिक");
DEFINE('_EW_STATS_FROM', "से");
DEFINE('_EW_STATS_TO', "सेवा में");
DEFINE('_EW_STATS_ADD_TO_GOALS', "लक�?ष�?यों को जोड़ें");
DEFINE('_EW_VISITS_ADD_GOAL_COUNTRY', "इस देश के लि�? लक�?ष�?य जोड़ें");
DEFINE('_EW_MENU_REPORT_BUG', "रिपोर�?ट बग या स�?विधा");
DEFINE('_EW_GOALS_COUNTRY', "देश");


/* translations 1.2.8b_12 */
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_UPPERCASE', "यदि आप दृश�?यपटल में अपरकेस में देशों के नाम करना चाहता हू�? (Eg: GERMANY, UNITED KINGDOM instead of Germany, United Kingdom)");
DEFINE('_EW_DESC_CACHE_FRONTEND_USERS', "सेकंड में समय दृश�?यपटल में उपयोगकर�?ताओं के दिलकश कैश");
DEFINE('_EW_DESC_FRONTEND_VISITORS_TOTAL_INITIAL', "दृश�?यपटल में: प�?रारंभिक मूल�?य में क�?ल दिखाया. उपयोगी है जब आप अन�?य स�?टेट उपकरण से चले ग�? |. (Eg.: 20000). 0 करने के लि�? वापस सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते है|");
DEFINE('_EW_DESC_IGNORE_USER', "इस textbox में सूचीबद�?ध उपयोगकर�?ताओं पर ध�?यान न दें. �?क प�?रति पंक�?ति. (Eg.: myself {line break} mark_*) ");
DEFINE('_EW_FRONTEND_USERS_MOST', "क�?ल से आज सर�?वाधिक सक�?रिय उपयोगकर�?ताओं की");
DEFINE('_EW_DESC_SPAMWORD_BANS_ENABLED', "Spamword नीचे दी गई सूची से शब�?दों के आधार पर रोक लगाई सक�?षम है?");
DEFINE('_EW_DESC_SPAMWORD_LIST', "सबसे आम स�?पैम स�?पैम bots द�?वारा प�?रय�?क�?त शब�?द. आप वाइल�?डकार�?ड यहा�? का उपयोग कर सकते हैं (Eg.? पी�?च rmac *). यदि उपरोक�?त सेटिंग सक�?षम है, ExtraWatch जा�?च करेगा कि क�?या हमलावर क�?छ इन शब�?दों के स�?पैम साथ अपनी वेबसाइट पर �?क फार�?म प�?रस�?त�?त (HTTP POST अन�?रोध). (यदि प�?रपत�?र केवल Joomla आधारित वेबसाइट लोड लागू होता है - मंच, टिप�?पणिया�?, लेकिन काफी प�?रभावी है स�?पैम bots जो करने के लि�? हर संभव प�?रपत�?र सबमिट करने की कोशिश ब�?लॉक))");
DEFINE('_EW_SETTINGS_ANTI_SPAM', "Anti-Spam");
DEFINE('_EW_DESC_FRONTEND_USER_LINK', "दृश�?यपटल उपयोगकर�?ता मॉड�?यूल में �?क लिंक है - त�?म �?क यूआर�?ल, जो ख�?ला है जब उपयोगकर�?ता का नाम क�?लिक निर�?दिष�?ट करने के लि�? अन�?मति देता है. {उपयोगकर�?ता} स�?ट�?रिंग, जो वास�?तविक उपयोगकर�?ता नाम के द�?वारा प�?रतिस�?थापित किया जा�?गा शामिल होना चाहि�?. (Eg. index.php?option=com_comprofiler&task=userProfile&user={user}) ");

/* translations 1.2.11b */
DEFINE('_EW_STATS_KEYPHRASE', "क�?ंजी वाक�?यांशों");
DEFINE('_EW_DESC_HISTORY_MAX_VALUES', "इतिहास टैब में अधिकतम मान (Example: <i>100</i>)");

DEFINE('_EW_DESC_ONLY_LAST_URI', "यात�?राओं में दिखाने के केवल अंतिम पृष�?ठ का दौरा किया, सभी नहीं");
DEFINE('_EW_DESC_HIDE_REPETITIVE_TITLE', "दोहरा�? SITENAME छ�?पायें दौरा पृष�?ठ शीर�?षक में यात�?राओं में");
DEFINE('_EW_DESC_HISTORY_MAX_DB_RECORDS', "आगंत�?कों की अधिकतम nuber जा�?�? इतिहास के लि�? डेटाबेस में रखने. इस सेटिंग के साथ सावधान रहना, यदि आप उच�?च यातायात है, यह वास�?तव में तेजी से विकसित कर सकते हैं. हमेशा की जांच कितना डेटा इतिहास तालिका स�?थिति में शामिल है ");
DEFINE('_EW_DESC_UNINSTALL_KEEP_DATA', "स�?थापना रद�?द पर डाटाबेस टेबल�?स रखें. इस विकल�?प की जा�?च के पहले की स�?थापना रद�?द अगर आप �?क उन�?नयन कर रहे हैं और अपने डेटा रखना चाहते हैं.");

/* email reports */
DEFINE('_EW_DESC_EMAIL_REPORTS_ENABLED', "आप पिछले दिन के लि�? रिपोर�?ट के साथ nighty ईमेल प�?राप�?त करेंगे, जो त�?म स�?बह में पढ़ सकते हैं|");
DEFINE('_EW_DESC_EMAIL_REPORTS_ADDRESS', "ईमेल पते पर जो आप इन रिपोर�?टों को प�?राप�?त करेंगे");
DEFINE('_EW_DESC_EMAIL_PERCENT_HIGHER_THAN', "जहां प�?रतिशत की त�?लना {मूल�?य} में अधिक है ईमेल रिपोर�?ट में केवल पंक�?तिया�? शामिल हैं. 0 करने के लि�? सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते <i>(example: 5)</i>");
DEFINE('_EW_DESC_EMAIL_ONE_DAY_CHANGE_POSITIVE', "Only include <b>positive one day</b> ईमेल रिपोर�?ट में परिवर�?तन मूल�?यों की त�?लना में अधिक {value} percent. Set to 0 if you don't want to use this feature <i>(example: 5)</i>");
DEFINE('_EW_DESC_EMAIL_ONE_DAY_CHANGE_NEGATIVE', "Only include <b>negative one day</b> ईमेल रिपोर�?ट में परिवर�?तन मूल�?यों से कम {value} percent. 0 करने के लि�? सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते <i>(example: -10)</i>");
DEFINE('_EW_DESC_EMAIL_SEVEN_DAY_CHANGE_POSITIVE', "Only include <b>positive seven day</b> ईमेल रिपोर�?ट में परिवर�?तन मूल�?यों की त�?लना में अधिक {value} percent.0 करने के लि�? सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते <i>(example: 2)</i>");
DEFINE('_EW_DESC_EMAIL_SEVEN_DAY_CHANGE_NEGATIVE', "Only include <b>negative seven day</b> ईमेल रिपोर�?ट में परिवर�?तन मूल�?यों से कम {value} percent. 0 करने के लि�? सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते <i>(example: -13)</i>");
DEFINE('_EW_DESC_EMAIL_TWENTY_EIGHT_DAY_CHANGE_POSITIVE', "Only include <b>positive twenty eight day</b> ईमेल रिपोर�?ट में परिवर�?तन मूल�?यों की त�?लना में अधिक {value} percent. 0 करने के लि�? सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते <i>(example: 2)</i>");
DEFINE('_EW_DESC_EMAIL_TWENTY_EIGHT_DAY_CHANGE_NEGATIVE', "Only include <b>negative twenty eight day</b> ईमेल रिपोर�?ट में परिवर�?तन मूल�?यों से कम {value} percent. 0 करने के लि�? सेट अगर आप इस स�?विधा का उपयोग नहीं करना चाहते <i>(example: -13)</i>");

DEFINE('_EW_DESC_FRONTEND_NOFOLLOW', "<b>(functional in PRO version)</b> इस सेटिंग को सक�?षम अगर आप लोगो विशेषता के साथ गाया लिंक बनाना चाहते हैं rel='nofollow' ");
DEFINE('_EW_DESC_EMAIL_NAME_TRUNCATE', "ईमेल पंक�?ति नाम के अधिकतम अक�?षर. इस बदलें अगर आपके ईमेल क�?लाइंट संदेश विंडो बह�?त छोटा है");

DEFINE('_EW_MENU_HISTORY', "इति�?हास");
DEFINE('_EW_MENU_EMAILS', "ईमेल");
DEFINE('_EW_MENU_STATUS', "DB स�?थति");
DEFINE('_EW_DESC_BLOCKED', "इन IP's विरोधी स�?पैम द�?वारा अवर�?द�?ध किया गया");


DEFINE('_EW_HISTORY_VISITORS', "आगंत�?कों इतिहास");
DEFINE('_EW_HISTORY_SHOWING_ONLY', " केवल %d पिछले रिकॉर�?ड को दिखा रहा है.
                To change this value, go to Settings -&gt; History &amp; Performance -&gt; HISTORY_MAX_DB_RECORDS . सावधान रहो, इस सेटिंग के नीचे डेटा का लोड बार को प�?रभावित करता है|  ");
DEFINE('_EW_MENU_BUG', "बग रिपोर�?ट");
DEFINE('_EW_MENU_FEATURE', "अन�?रोध फ़ीचर");

DEFINE('_EW_VISITS_CAME_FROM_KEYWORDS', "कीवर�?ड");

DEFINE('_EW_BLOCKING_UNBLOCK', "उन�?लोच�?क");
DEFINE('_EW_STATS_KEYPHRASE ', "म�?ख�?य वाक�?यांश");

DEFINE('_EW_STATUS_DATABASE_TABLE_NAME', "तालिका नाम");
DEFINE('_EW_STATUS_DATABASE_ROWS', "पंक�?तिया�?");
DEFINE('_EW_STATUS_DATABASE_DATA', "डेटा");
DEFINE('_EW_STATUS_DATABASE_TOTAL', "टोटल");

DEFINE('_EW_EMAIL_REPORTS', "ईमेल रिपोर�?टें");
DEFINE('_EW_EMAIL_REPORT_GENERATED', "जनरेट फ़िल�?टर कल से ईमेल रिपोर�?ट");
DEFINE('_EW_EMAIL_REPORTS_VALUE_FILTERS', "ईमेल मूल�?य फ़िल�?टर");
DEFINE('_EW_EMAIL_REPORTS_VALUE', "मूल�?यांकन रिपोर�?ट");
DEFINE('_EW_EMAIL_REPORTS_PERCENT', "प�?रतिशत");
DEFINE('_EW_EMAIL_REPORTS_1DAY_CHANGE', "1-day परिवर�?तन");
DEFINE('_EW_EMAIL_REPORTS_7DAY_CHANGE', "7-day परिवर�?तन");
DEFINE('_EW_EMAIL_REPORTS_28DAY_CHANGE', "28-day परिवर�?तन");
DEFINE('_EW_ANTISPAM_BLOCKED', "ExtraWatch अवर�?द�?ध है %d स�?पैमर हिट क�?ल आज,: %d");
DEFINE('_EW_ANTISPAM_ADDRESSES', "अवरोधित IP पते");
DEFINE('_EW_ANTISPAM_SETTINGS', "विरोधी स�?पैम सेटिंग�?स");
DEFINE('_EW_TRAFFIC_AJAX', "AJAX अद�?यतन यातायात (except maps)");


DEFINE('_EW_HISTORY_PREVIOUS', "पिछला");
DEFINE('_EW_HISTORY_NEXT', "अगला");

/** additional translation for 1.2.11 for countries in more rows */
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_MAX_COLUMNS', "देशों के स�?तंभों की संख�?या");
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_MAX_ROWS', "देशों की पंक�?तियों की संख�?या");
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_NAMES', "देश के नाम या नहीं प�?रदर�?शित करना");
DEFINE('_EW_DESC_FRONTEND_COUNTRIES_FLAGS_FIRST', "प�?रदर�?शन पहली �?ंडे, then percents");

/* ExtraWatch 1.2.14 translations */

DEFINE('_EW_GOALS_GET_INVERSED', "GET inversed हालत");
DEFINE('_EW_GOALS_POST_INVERSED', "POST inversed हालत");
DEFINE('_EW_GOALS_TITLE_INVERSED', "Title inversed हालत");
DEFINE('_EW_GOALS_USERNAME_INVERSED', "Username inversed हालत");
DEFINE('_EW_GOALS_CAME_FROM_INVERSED', "Came from inversed हालत");

DEFINE('_EW_STATS_MAP', "पिछली म�?लाकात का नक�?शा");
DEFINE('_EW_STATS_MAP_ENTER_KEY', "दर�?ज करें <a href='http://www.ipinfodb.com/register.php' target='_blank'>ipinfodb.com</a> key पिछली म�?लाकात के मानचित�?र प�?रदर�?शित करने के लि�?:");
DEFINE('_EW_STATS_MAP_STORE_KEY', "store key");
DEFINE('_EW_STATS_MAP_INVALID_KEY', "कृपया मान�?य दर�?ज करें ipinfodb key त�?म से प�?राप�?त: <a href='http://www.ipinfodb.com/register.php' target='_blank'>ipinfodb.com</a>");

DEFINE('_EW_SIZEQUERY_BAD_REQUEST', "ग़लत अन�?रोध: ");

DEFINE('_EW_VISIT_SUBMITED_FIELDS', "पोस�?ट किया फार�?म क�?षेत�?रों:");
DEFINE('_EW_VISIT_URL_PARAMETERS', "URL पैरामीटर:");
DEFINE('_EW_VISIT_ADD_PAGE', " लक�?ष�?य के रूप में पृष�?ठ जोड़ें");
DEFINE('_EW_VISIT_BLOCK_IP', " यह IP पता खंड करे");
DEFINE('_EW_VISIT_SUBMITED_FROM_VARIABLE', " इस प�?रस�?त�?त फार�?म चर लक�?ष�?य के रूप में जोड़ें");
DEFINE('_EW_VISIT_URL_PARAMETER_GOAL', " इस URL पैरामीटर लक�?ष�?य के रूप में जोड़ें");

DEFINE('_EW_TREND_EMPTY', "खाली");

DEFINE('_EW_NOT_NUMBER', "चेतावनी: आपके द�?वारा दर�?ज मान कोई संख�?या नहीं है| ExtraWatch ठीक से काम नहीं करेगा!");
DEFINE('_EW_EVALUATION_LEFT', "&nbsp; यह 15 दिन मूल�?यांकन संस�?करण है. दिन बचा : <b>%d</b>. कृपया �?क जीवन की खरीद <a href='http://www.codegravity.com/donate/extrawatch/' target='_blank'>आपके डोमेन के लि�? ExtraWatch लाइसेंस</a> इस और आगामी संस�?करण के लि�?.");
DEFINE('_EW_TRIAL_VERSION_EXPIRED', "आपका परीक�?षण संस�?करण समाप�?त हो गया है. कृपया ExtraWatch खरीद");

DEFINE('_EW_CONFIG_LICENSE_ACTIVATED', "लाइसेंस सफलतापूर�?वक सक�?रिय. श�?क�?रिया");
DEFINE('_EW_CONFIG_LICENCE_DONT_MATCH', "<b> गलती: लाइसेंस क�?ंजी और अपने डोमेन से मेल नहीं खाती |</b><br/>क�?या त�?म �?क आप नीचे देख के रूप में दान के रूप में �?क ही डोमेन नाम दर�?ज? <br/>Click '<b>सही सक�?रियकरण अन�?रोध key</b>' नीचे,या contact: support@codegravity.com<br/>");

DEFINE('_EW_VIEW_ADMINBODY_LONG_MESSAGE', "यदि आप संदेश देख रहे हैं वह भी लंबे समय के लि�? ऊपर, अपने लाइव साइट गलत हो सकता है|
                    Open the components/com_extrawatch/config.php
                    Uncomment और अपने वास�?तविक लाइव साइट सेट. Eg.:
                    define('EXTRAWATCH_LIVE_SITE', 'http://www.codegravity.com');");

DEFINE('_EW_ADMINBODY_LIVE_SITE', "चेतावनी: अपने ब�?राउज़र में साइट और विन�?यास में रहते साइट: %s and %s मेल नहीं खाते|");
DEFINE('_EW_ADMINBODY_SET_LIVE_SITE', "जीना साइट के लि�? सेट: %s और जारी रखने...");

DEFINE('_EW_ADMINHEADER_JW', "ExtraWatch");
DEFINE('_EW_ADMINHEADER_REMOVE_BACKLINK', " Backlink हटाना");
DEFINE('_EW_ADMINHEADER_KNOWLEDGE_BASE', "ज�?ञानकोश");
DEFINE('_EW_ADMINHEADER_FLOW', "प�?रवाह");
DEFINE('_EW_ADMINHEADER_GRAPHS', "रेखांकन");
DEFINE('_EW_ADMINHEADER_COMPONENTS', "अवयव");
DEFINE('_EW_ADMINHEADER_REVIEW', "प�?नर�?विलोकन");
DEFINE('_EW_ADMINHEADER_WRITE', "�?क लिखें ");

DEFINE('_EW_FLOW_TRAFFIC', "यातायात प�?रवाह");
DEFINE('_EW_FLOW_SELECT_PAGE', "पृष�?ठ का चयन करें:");
DEFINE('_EW_FLOW_OUTG_LINKS', "रूट जावक लिंक गिनती:");
DEFINE('_EW_FLOW_NESTING', "नेस�?टिंग स�?तर:");
DEFINE('_EW_FLOW_SCALE', "पैमाना:");

DEFINE('_EW_COMERCIAL_AD_FREE', "विज�?ञापन म�?क�?त संस�?करण");
DEFINE('_EW_COMERCIAL_THANK_DONATION', "आप अपने दान के लि�? बह�?त बह�?त धन�?यवाद!");
DEFINE('_EW_COMERCIAL_REGISTRATION_KEY', "आपके डोमेन %s के लि�? पंजीकरण की क�?ंजी है: ");
DEFINE('_EW_COMERCIAL_BACKLINKS_REMOVE', "अब आप backlink हटाने या छ�?पा सकते हैं सेटिंग से दृश�?यपटल में ExtraWatch लोगो ");


DEFINE('_EW_SIZES_LAST_CHECK', "अंतिम चेक पर प�?रदर�?शन किया गया था:");
DEFINE('_EW_SIZES_ADMINISTRATOR', "BLUE = Size of component/module in /administrator directory");

DEFINE('_EW_SIZECOMPONENTS_COMPONENT', "संघटक अंग");
DEFINE('_EW_SIZECOMPONENTS_TOTAL', "टोटल:");
DEFINE('_EW_SIZECOMPONENTS_SIZE', "आकार");
DEFINE('_EW_SIZECOMPONENTS_REFRESH_ALL', "सभी ताज़ा करें");

DEFINE('_EW_SIZEDATABASE_TABLE', "तालिका");
DEFINE('_EW_SIZEDATABASE_SIZE', "आकार");
DEFINE('_EW_SIZEDATABASE_1DAY', "1-दिन बदलें");
DEFINE('_EW_SIZEDATABASE_7DAY', "7-दिन बदलें");
DEFINE('_EW_SIZEDATABASE_28DAY', "28-दिन बदलें");
DEFINE('_EW_SIZEDATABASE_NO_DATA', "कोई डेटा नहीं");
DEFINE('_EW_SIZEDATABASE_TOTAL', "टोटल:");

DEFINE('_EW_SIZEMODULES_REFRESH_ALL', "सभी ताज़ा करें");
DEFINE('_EW_SIZEMODULES_TOTAL', "टोटल:");
DEFINE('_EW_SIZEMODULES_MODULE', "मापांक");
DEFINE('_EW_SIZEMODULES_SIZE', "आकार");

DEFINE('_EW_SIZES_FILES', "फ़ाइलें और निर�?देशिका�?�?");
DEFINE('_EW_SIZES_BYTES', "बाइट�?स");
DEFINE('_EW_SIZES_KB', "KB");
DEFINE('_EW_SIZES_MB', "MB");
DEFINE('_EW_SIZES_GB', "GB");
DEFINE('_EW_SIZES_REFRESH', "प�?नश�?चर�?या");

DEFINE('_EW_STATS_FOOTER', "ExtraWatch &copy;2006-2013 by CodeGravity.com");

DEFINE('_EW_STATUS_MB', "MB");
DEFINE('_EW_STATUS_DATABASE', "डेटाबेस तालिका आकार");


DEFINE('_EW_DESC_IPINFODB_KEY', "अंतिम यात�?रा के मानचित�?र ipinfodb.com key from: <a href='http://www.ipinfodb.com/register.php' target='_blank'>ipinfodb.com</a>");
DEFINE('_EW_SETTINGS_FORCE_TIMEZONE_OFFSET', "फोर�?स समय क�?षेत�?र ऑफसेट");


/* ExtraWatch 1.2.17 translations */
DEFINE('_EW_MENU_UPDATE', "अद�?यतन");
DEFINE('_EW_MENU_UPDATE_TITLE', "बैकअप और उन�?नयन");
DEFINE('_EW_ADMINHEADER_NA_IN_THIS_VERSION', "म�?क�?त संस�?करण में उपलब�?ध नहीं है, कृपया लाइसेंस टैब की जा�?च करे|");
DEFINE('_EW_SPAMWORD_BANS_ENABLED', "स�?पैम शब�?द बान सक�?षम हे|");
DEFINE('_EW_SPAMWORD_LIST', "स�?पैम शब�?द सूची");
DEFINE('_EW_HIDE_REPETITIVE_TITLE', "दोहरा�? शीर�?षक छिपा�?�?");
DEFINE('_EW_TRUNCATE_VISITS', "Truncate दौरा");
DEFINE('_EW_TRUNCATE_STATS', "Truncate आ�?कड़े");
DEFINE('_EW_TRUNCATE_GOALS', "Truncate लक�?ष�?य");
DEFINE('_EW_LIMIT_BOTS', "सीमा Bots");
DEFINE('_EW_LIMIT_VISITORS', "सीमा आगंत�?कों");
DEFINE('_EW_TOOLTIP_WIDTH', "चौड़ाई टूलटिप");
DEFINE('_EW_TOOLTIP_HEIGHT', "ऊ�?चाई टूलटिप");
DEFINE('_EW_TOOLTIP_URL', "लटिप URL");
DEFINE('_EW_TOOLTIP_ONCLICK', "लटिप OnClick");
DEFINE('_EW_IP_STATS', "IP स�?टैट�?�?स");
DEFINE('_EW_IPINFODB_KEY', "IP Info DB key ");
DEFINE('_EW_ONLY_LAST_URI', "केवल अंतिम URI ");

DEFINE('_EW_FRONTEND_HIDE_LOGO', "फ�?रंट �?ंड छ�?पा�?�? लोगो ");
DEFINE('_EW_FRONTEND_NOFOLLOW', "फ�?रंट �?ंड का पालन नहीं,");
DEFINE('_EW_FRONTEND_NO_BACKLINK', "फ�?रंट �?ंड कोई वापस लिंक");
DEFINE('_EW_FRONTEND_USER_LINK', "फ�?रंट उपयोगकर�?ता लिंक");
DEFINE('_EW_FRONTEND_COUNTRIES_FIRST', "फ�?रंट �?ंड पहला देश");
DEFINE('_EW_FRONTEND_COUNTRIES_NAMES', "फ�?रंट �?ंड देश का नाम");
DEFINE('_EW_FRONTEND_COUNTRIES_UPPERCASE', "फ�?रंट �?ंड अपर केस देश");
DEFINE('_EW_FRONTEND_COUNTRIES_FLAGS_FIRST', "फ�?रंट �?ंड देश पहले ध�?वज ");
DEFINE('_EW_FRONTEND_COUNTRIES_NUM', "फ�?रंट �?ंड देशों संख�?या");
DEFINE('_EW_FRONTEND_COUNTRIES_MAX_COLUMNS', "फ�?रंट �?ंड अधिकतम स�?तंभ देश");
DEFINE('_EW_FRONTEND_COUNTRIES_MAX_ROWS', "फ�?रंट �?ंड अधिकतम पंक�?तिया�? देश");
DEFINE('_EW_FRONTEND_VISITORS_TODAY', "फ�?रंट �?ंड आज आगंत�?कों ");
DEFINE('_EW_FRONTEND_VISITORS_YESTERDAY', "फ�?रंट �?ंड कल आगंत�?कों ");
DEFINE('_EW_FRONTEND_VISITORS_THIS_WEEK', "मोर�?चे की समाप�?ति इस सप�?ताह के आगंत�?कों ");
DEFINE('_EW_FRONTEND_VISITORS_LAST_WEEK', "फ�?रंट �?ंड अंतिम सप�?ताह आगंत�?कों ");

DEFINE('_EW_FRONTEND_VISITORS_THIS_MONTH', "फ�?रंट �?ंड यह महीना आगंत�?कों ");
DEFINE('_EW_FRONTEND_VISITORS_LAST_MONTH', "फ�?रंट �?ंड आखरी महीना आगंत�?कों");
DEFINE('_EW_FRONTEND_VISITORS_TOTAL', "फ�?रंट �?ंड छ�?पा�?�? आगंत�?कों क�?ल");
DEFINE('_EW_FRONTEND_VISITORS_TOTAL_INITIAL	', "फ�?रंट �?ंड प�?रारंभिक क�?ल");
DEFINE('_EW_HISTORY_MAX_VALUES', "इतिहास अधिकतम मान");
DEFINE('_EW_HISTORY_MAX_DB_RECORDS', "इतिहास अधिकतम रिकॉर�?ड�?स");
DEFINE('_EW_UPDATE_TIME_VISITS', "समय दौरा");
DEFINE('_EW_UPDATE_TIME_STATS', "समय दौरा");
DEFINE('_EW_STATS_MAX_ROWS', "आ�?कड़े अधिकतम पंक�?तिया�?");
DEFINE('_EW_STATS_IP_HITS', "आ�?कड़े IP हिट");
DEFINE('_EW_MAXID_BOTS', "मैक�?स ID बोट�?स");
DEFINE('_EW_MAXID_VISITORS', "अधिकतम ID आगंत�?कों");
DEFINE('_EW_STATS_KEEP_DAYS', "आ�?कड़े दिनों रखें ");
DEFINE('_EW_CACHE_FRONTEND_COUNTRIES', "कैश फ�?रंट �?ंड देश ");
DEFINE('_EW_CACHE_FRONTEND_VISITORS', "कैश फ�?रंट �?ंड आगंत�?कों ");

DEFINE('_EW_UNINSTALL_KEEP_DATA	', "डेटा रखें स�?थापना रद�?द करें ");
DEFINE('_EW_IGNORE_IP', "उपेक�?षा IP");
DEFINE('_EW_IGNORE_URI', "उपेक�?षा URI");
DEFINE('_EW_IGNORE_USER', "उपेक�?षा User");
DEFINE('_EW_BLOCKING_MESSAGE', "अवर�?द�?ध संदेश");
DEFINE('_EW_SERVER_URI_KEY', "Server URI key");
DEFINE('_EW_FRONTEND_VISITORS_TOTAL_INITIAL', "रंट �?ंड आगंत�?कों प�?रारंभिक क�?ल");
DEFINE('_EW_SIZEDATABASE_RECORDS', "अभिलेख");
/***********EDITs*****************/
DEFINE('_EW_ANTISPAM_BLOCKING_TEXT', " अवर�?द�?ध प�?रभावी बनाने के लि�?, आप किसी भी सामग�?री या रूपों से पहले ExtraWatch �?जेंट को प�?रकाशित करने की जरूरत है.. Eg. on left side in your template.
                    <br/>
                    Go to Module Manager -> ExtraWatch agent -> select position as left");

DEFINE('_EW_EMAIL_SEO_REPORTS', "SEO रिपोर�?ट");
DEFINE('_EW_DESC_EMAIL_SEO_REPORTS_ENABLED', "SEO ईमेल रिपोर�?ट सक�?षम");
DEFINE('_EW_WATCH_INSTALLATION_DEMO', "स�?थापना डेमो देखें");

/** JW 1.2.18 */
DEFINE('_EW_ADMINHEADER_HEATMAP', "Heatmap");
DEFINE('_EW_HEATMAP_CLICKS', "clicks");
DEFINE('_EW_HEATMAP_TITLE', "title");
DEFINE('_EW_HEATMAP_CLICK_OPEN', "Click to open heatmap");
DEFINE('_EW_NO_DATA', "This section contains no data yet ...");
DEFINE('_EW_POSITION', "Search result num.");
DEFINE('_EW_BLOCKING_REASON', 'reason');
DEFINE('_EW_BLOCKING_UNAUTHORIZED_ACCESS', 'Unauthorized Access');
DEFINE('_EW_BLOCKING_BLOCKED_MANUALLY', 'Blocked manually');
DEFINE('_EW_BLOCKING_BAD_WORD', "bad word");
DEFINE('_EW_HEATMAP_OF', "of");
DEFINE('_EW_URI', "uri");
DEFINE('_EW_COUNT', "count");
DEFINE('_EW_SEO_REPORT_FOR', "SEO report for");
DEFINE('_EW_SEO_MOST_DYNAMIC_KEYPHRASES', "Most dynamic keyphrases");
DEFINE('_EW_SEO_MIN_POSITION', "min position");
DEFINE('_EW_SEO_AVG_POSITION', "average position");
DEFINE('_EW_SEO_MAX_POSITION', "max position");
DEFINE('_EW_SEO_CHANGE', "change");
DEFINE('_EW_SEO_DATE_OF_LAST_CHANGE', "date of last change");
DEFINE('_EW_SEO_TOTAL_VISITS_FROM_SEARCH_ENGINES', "Total visits by keyphrase from search engines");
DEFINE('_EW_GOAL_ADD_SUBMITTED_VALUE', "Add submitted variable as goal");
DEFINE('_EW_RENDERED_IN', "Rendered in");
DEFINE('_EW_DESC_SEO_RENDER_ONLY_CHANGED', "Render only values which were already used in previous days (have some percentage in change column)");
DEFINE('_EW_SEO_REPORT_SETTINGS', "SEO Report Settings");


DEFINE('_EW_HTTP500_ERROR', "Could not initialize ExtraWatch javascript functions! Browser could not load: \\n%s, because it returned HTTP 500 internal server error.  \\nThis usually of security restrictions by other components/plugins. Please check your .htaccess file in your root Joomla directory.  \\nIf you use Akeeba Admin tools, you need to go \ 'Akeeba htaccess maker\ ' -> \ 'Server Protection\ ' -> \ 'Exceptions\ ' -> \ 'Allow direct access to these files\ ', and add: \\n/components/com_joomlawatch/block.php \\n/components/com_joomlawatch/img.php \\n/components/com_joomlawatch/last.php \\n/components/com_joomlawatch/lastvisit.php \\n/components/com_joomlawatch/sizequery.php \\n/components/com_joomlawatch/sizequerytotal.php \\n/components/com_joomlawatch/stats.php \\n/components/com_joomlawatch/timezone.php \\n/components/com_joomlawatch/tooltip.php \\n/components/com_joomlawatch/trendtooltip.php \\n/components/com_joomlawatch/vars.php \\n/components/com_joomlawatch/visits.php \\n/components/com_joomlawatch/js/joomlawatch.js.php \\n/components/com_joomlawatch/js/maps.js.php ");

DEFINE('_EW_AGENT_NOT_PUBLISHED_ERROR_JOOMLA',"Warning: No visits are currently being recorded. Your ExtraWatch Agent module is published, but most probably in position which does not exist in your template.
                <br/><br/>
                To fix this: <br/>
                1. go to Modules section -&gt; ExtraWatch Agent <br/>
                2. change the Position to 'left' or 'footer' (or some other position).<br/>
                3. check if new visits are being recorded
                <br/><br/>
                If this won't help, you can also: <br/>
                1. set 'Show Title' to 'Yes' in  Modules section -&gt; ExtraWatch Agent <br/>
                2. try to use some other positions of ExtraWatch agent module<br/>
                3. save<br/>
                4. after reload of your main page look for 'ExtraWatch Agent' text.<br/>
                5. this way you'll make sure the Agent module is published.<br/>
                6. after that you can set 'Show Title' back to 'No'.
                ");
/** Goals/Import IP */
DEFINE('_EW_GOALS', "Goals");
DEFINE('_EW_GOALS_IMPORT', "Import goals");
DEFINE('_EW_GOALS_IMPORT_XML', "Import XML");
DEFINE('_EW_GOALS_EXPORT', "Export goals");
DEFINE('_EW_GOALS_FILENAME', "Select goals previously exported as XML");
DEFINE('_EW_ANTISPAM_IMPORT_CSV', "import anti-spam ip csv");

DEFINE('_EW_AGENT_NOT_PUBLISHED_ERROR_WORDPRESS',"Warning: No visits are being recorded. You must go to Appearance->Widgets section, <br/>find ExtraWatchAgent widget and drag&drop it to some of the containers on the right side. <br/>You can publish also other ExtraWatch modules this way. <br/><br/>Check the demonstration video:<br/><br/><iframe id='video-player' width='800' height='468' src='http://www.youtube.com/embed/uu_luBKJ8jI?enablejsapi=1&autoplay=1&rel=0&modestbranding=1&showinfo=0&showsearch=0&vq=hd1080' frameborder='0' allowfullscreen></iframe><br/><br/>In case of any questions about installation or problems, you can take advantage of our support on <a href='http://www.extrawatch.com' target='_blank'>http://www.extrawatch.com</a>");


/** 2.1 */
DEFINE('_EW_MENU_DOWNLOADS', "Downloads");
DEFINE('_EW_DOWNLOADS_FILE_NOT_FOUND', "FILE NOT FOUND");
DEFINE('_EW_DOWNLOADS_HTACCESS_NOT_WRITABLE', "Your .htaccess is not Writable.");
DEFINE('_EW_DOWNLOADS_HTACCESS_COULD_NOT_BE_CREATED', ".htaccess could not be created, Please create your own.");
DEFINE('_EW_DOWNLOADS_ADD_EXTENSION', "Add Extension");
DEFINE('_EW_DOWNLOADS_EXTENSION_NAME', "Extension Name");
DEFINE('_EW_DOWNLOADS_WARNING', "<b>Warning:</b> always backup your .htaccess file before adding new extension or path! Do not add 'php' as monitored extension. <br/>Be also careful with adding png/jpg, the download count will be increased once someone opens your page which contains images with this extension.");
DEFINE('_EW_DOWNLOADS_ADD_FILE_PATH', "Add File/Path");
DEFINE('_EW_DOWNLOADS_FILE_PATH_NAME', "File/Path Name");
DEFINE('_EW_DOWNLOADS_DOWNLOAD_MONITOR', "Download Monitor");
DEFINE('_EW_DOWNLOADS_EXTENSIONS_BEING_MONITORED', "Extensions Being Monitored");
DEFINE('_EW_DOWNLOADS_FILES_PATHS_BEING_MONITORED', "Files/Paths Being Monitored");
DEFINE('_EW_DOWNLOADS_EDIT_EXTENSION', "Edit Extension");
DEFINE('_EW_DOWNLOADS_EDIT_FILE_PATH', "Edit File/Path");
DEFINE('_EW_DOWNLOADS_EXTENSION', "Extension");
DEFINE('_EW_DOWNLOADS_ACTION', "Action");
DEFINE('_EW_DOWNLOADS_PATH', "Path");
DEFINE('_EW_DOWNLOADS_TODAY', "Today");
DEFINE('_EW_DOWNLOADS_YESTERDAY', "Yesterday");
DEFINE('_EW_DOWNLOADS_THIS_WEEK', "This Week");
DEFINE('_EW_DOWNLOADS_LAST_WEEK', "Last Week");
DEFINE('_EW_DOWNLOADS_THIS_MONTH', "This Month");
DEFINE('_EW_DOWNLOADS_LAST_MONTH', "Last Month");
DEFINE('_EW_DOWNLOADS_INCOMPLETE', "The required Information is incomplete");

DEFINE('_EW_STATS_SOCIAL_MEDIA', "Media");
DEFINE('_EW_MENU_AVAILABLE_IN_PRO',"Available in PRO version");
DEFINE('_EW_DOWNLOADS_TOTAL',"Total Downloads");


/** 3.0 - hosted version */
DEFINE('_EW_GOALS_CLICKED_ELEMENT_XPATH_CONDITION', "xpath of clicked element condition");
DEFINE('_EW_DESC_GOALS_CLICKED_ELEMENT_XPATH_CONDITION', "xpath of clicked element condition");

DEFINE('_EW_STATS_DEVICES', "Mobile Devices");

DEFINE('_EW_BLOCKED_BASED_ON_GOAL',"Blocked based on goal no. %s");


DEFINE('_EW_TIME_BETWEEN_VISITS',"Total time spent");
DEFINE('_EW_LEFT_WEBSITE',"Left website");
DEFINE('_EW_MENU_USERS',"Users");
DEFINE('_EW_USERS_BLOCK_IP_CONFIRM',"Do you really want to block this IP address?");
DEFINE('_EW_USERS_SHARING_HEADER',"Users sharing same login");
DEFINE('_EW_USERS_SHARING_DESC',"Contains users who accessed the website from different IP addresses and/or from different country but with same login. This might be a warning for you, that they're sharing their account with someone else.");
DEFINE('_EW_USERS_ACTIVITY_HEADER',"Latest user activity");
define('_EW_DESC_SEO_LIST_ENCRYPTED_KEYWORDS', "Google hides passing particular keywords from google search to websites. This will reveal the keyword's position,<br/> but not the keyword itself. Enable this option if you want to see also position of these encrypted keywords in stats.");

DEFINE('_EW_SEO_MOST_POPULAR_KEYPHRASES',"Most popular keyphrases");
DEFINE('_EW_SEO_MOST_POPULAR_KEYPHRASES_DESC',"These are the keyphrases by which was your website found. You can copy this list and use it with some 3rd party service, which will give you an overview of SERP (Search Engine Rank Position). You can then optimize your website using SEO techniques,	and watch the increase of traffic in right upper side of main dashboard - displayed as a cyan bar");

DEFINE('_EW_USERS_ALERT_EMAIL_SUBJECT',"Alert - user '%s' uses different IP address: '%s'");
DEFINE('_EW_USERS_ALERT_EMAIL_CONTENT',"You can block this user from ExtraWatch Users section");
DEFINE('_EW_MAX_RECORDS',"Displaying max. %d records");

DEFINE('_EW_DESC_USERS_SEND_ALERT_EMAILS',"If checked, you'll get an email once user uses different IP. This can help you to detect immediately, which user shares his login with someone else. Useful, if you're using paid accounts.");
DEFINE('_EW_DESC_SEO_SHOW_ALL_TIME_REPORT', "Do not filter by particular dates, show all time SEO report");

DEFINE('_EW_DOWNLOADS_ALLOW_ONLY_REFERRER', "Allow only when referred from: ");
DEFINE('_EW_DOWNLOADS_ALLOWED_REFERRER', "Allowed Referrer");
DEFINE('_EW_DOWNLOADS_NOT_ALLOWED',"File download restricted by ExtraWatch rule. Please contact: %s");

DEFINE('_EW_DOWNLOADS_EMAIL_RESTRICTED_SUBJECT',"Download restricted for IP: %s");
DEFINE('_EW_DOWNLOADS_EMAIL_RESTRICTED_BODY',"Someone from IP: %s attempted to download file: %s referred from %s, but it's restricted by ExtraWatch download referrer check");

DEFINE('_EW_ADMINHEADER_CLICK_AREAS', "Click Areas");
DEFINE('_EW_NO_TITLE','No Title');
DEFINE('_EW_CLICK_HEATMAP_FOR','Click Heatmap for ');
DEFINE('_EW_CLICK_AREAS_FOR','Clicks Areas for ');

DEFINE('_EW_GOALS_SEND_EMAIL','Send an email');
DEFINE('_EW_DESC_GOALS_SEND_EMAIL','You will get an email everytime the goal has been reached. Email address is taken from "Emails" section.');
DEFINE('_EW_GOAL_EMAIL_SUBJECT', "Goal '%s' was achieved, count: %d");
DEFINE('_EW_VISITS_GOAL_REACHED', " Goal '%s' was reached");

DEFINE('_EW_DOWNLOADS_TOTAL_WEEKLY', "Total weekly");
DEFINE('_EW_ACTIVE', "active");
DEFINE('_EW_DOWNLOAD_PRO', "Download PRO version");
DEFINE('_EW_VISITS_HEATMAP_CLICK_COUNT', "Total clicks today: %d");
DEFINE('_EW_HEATMAP_LOADING','Loading Heatmap table ...');
DEFINE('_EW_ANTISPAM_INVALID_EXTENSION', "Invalid extension type, .csv expected"); 
DEFINE('_EW_ANTISPAM_NUM_IP_FROM_CSV_IMPORTED', "Imported %d IP addresses from .csv file"); 